app/controllers/books_controller.rb

    def show
        @book = Book.new
        @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

    def create
        @book = Book.new(book_params)
        @book.user_id = current_user.id
        if @book.save
            flash[:success] = "You have created book successfully."
            redirect_to book_path(@book.id)
        else
            @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "f"], ["body", "f"], ["user_id", "3"], ["created_at", "2020-04-26 02:09:29.846998"], ["updated_at", "2020-04-26 02:09:29.846998"]]
SELECT "books".* FROM "books"

    def update
        @book = Book.find(params[:id])
        if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "vvvvvf"], ["updated_at", "2020-04-26 06:09:27.487067"], ["id", 38]]