app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @book = Book.new
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @book = Book.new
        @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "oooo"], ["profile_image_id", "3f2746f269cbc7f480312ece093d9d31d1dcb4988f1cddf212f0c0beccce"], ["updated_at", "2020-02-17 09:21:58.181935"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)